local e = aura_env
e.AoeCastingTimes = {}
e.InterruptCastingTimes = {}

e.AOEOld = {
    --驭雷栖巢
    [427404] = true,  --局部风暴
    [430812] = true,  --诱集暗影
    [1214523] = true, --饕餮虚空

    --暗焰裂口
    [425394] = true, --吹灭之息
    [428266] = true, --永恒黑暗
    [428066] = true, --压制咆哮
    [430171] = true, --镇火冲击

    --水闸行动
    [460156] = true, --快速启动
    [473070] = true, --唤醒沼泽
    [465463] = true, --涡轮增压
    [465827] = true, --扭曲精华
    [469721] = true, --逆流

    --燧酿酒庄
    [439365] = true, --喷涌佳酿
    [439524] = true, --振翼之风
    [435622] = true, --遮天蔽日！
    [442995] = true, --蜂拥惊喜
    [463218] = true, --烈性酒桶

    --圣焰隐修院
    [448492] = true, --雷霆一击
    [427897] = true, --热浪
    [424431] = true, --圣光烁辉
    [448791] = true, --神圣鸣罪
    [428169] = true, --盲目之光

    --伤逝剧场
    [1215741] = true, --强力碾压
    [473513] = true,  --灵魂盛宴
    [339573] = true,  --屠戮回响
    [333241] = true,  --暴脾气
    [330716] = true,  --灵魂风暴
    [333827] = true,  --震地践踏
    [1215850] = true, --碾地猛击

    --麦卡贡车间
    [1215102] = true, --震地
    [1215409] = true, --超级电钻
    [297128] = true,  --短路

    --暴富矿区
    [262347] = true, --静电脉冲
    [258622] = true, --地震回荡
    [473168] = true, --迅速萃取
    [269429] = true, --充能射击

}
e.AOESpellList = {
    [326409] = true, --痛击
    [326410] = true, --痛击
    [326411] = true, --痛击
    [326412] = true, --痛击
    [326413] = true, --痛击
    [326414] = true, --痛击
    [326415] = true, --痛击
}
--打断技能，需要主动中断当前施法以免被沉默
e.InterruptSpellList = {
    [427609] = true, --瓦解怒吼
    [342135] = true, --打断怒吼
    [339415] = true, --雷音贯耳
    [1235326] = true, --瓦解尖叫
    
}
